; Type with random letterlike symbols.
#Requires AutoHotkey v1
#Warn
#NoEnv
#SingleInstance, Force
#MaxHotkeysPerInterval, 500
SendMode, Input
SetBatchLines, -1
SetWorkingDir, %A_ScriptDir%

Send_random_char_from_array_string(comma_delimited_string_array)  {
    array := StrSplit(comma_delimited_string_array, ",")
    Random, randint, 1, array.MaxIndex()
    charToSend := array[randint]
    Send, %charToSend%
}
Return

; there are be duplicates, too lazy to fix that
a::Send_random_char_from_array_string("𝔄,𝕬,𝓐,𝒜,𝔸,Ａ,ɑׁׅ֮,ᴀ,🄰,🅰,ₐ,ᴬ,Ⓐ,ค,A,ǟ,Ꮧ,ą,ค,𝐀,𝗔,𝘈,𝘼,𝙰,Λ,α,Ä,₳,卂,ﾑ,𝖆,Ã,𝓪,𝒶,𝕒,ａ,𝒶,ᴀ,z,🄰,ƹ,🅰,ₐ,ᵃ,ⓐ,ค,α,ǟ,Ꮧ,ą,ค,𝐚,𝗮,𝘢,𝙖,𝚊,Λ,α,å,₳,卂,ﾑ,𝙰,A,𝐴,ᗅ,𝑨,𝚨,𝕬,𝖠,А,Α,𝛢,𝝖,𝒜,𝜜,𖽀,𝓐,𝞐,Ａ,𝗔,𝘈,Ꭺ,ꓮ,𝐀,𝔄,𝔸,𐊠,𝘼,𝝰,a,ａ,𝑎,𝗮,𝕒,𝖆,𝓪,𝚊,𝞪,а,ɑ,α,𝔞,𝒂,𝘢,𝛂,⍺,𝒶,𝙖,𝜶,𝛼,𝐚,𝖺,ᾰ,ḁ,ἀ,ἁ,ἂ,ἃ,ἄ,ἅ,ἆ,ἇ,ạ,ả,ầ,ấ,ẩ,ẫ,ậ,ắ,ằ,ẳ,ẵ,ặ,ẚ,ᾱ,ᾲ,ᾳ,ᾴ,ᾶ,ᾷ,a,Ѧ,Ặ,Ἀ,Ἁ,Ἂ,Ἃ,Ἄ,Ἅ,Ἆ,Ἇ,Ạ,Ả,Ấ,Ầ,Ẩ,Ẫ,Ậ,Ắ,Ằ,Ẳ,Ẵ")
b::Send_random_char_from_array_string("𝔅,𝕭,𝓑,𝐵,𝔹,Ｂ,᥇,ϐׁׅ֒,ʙ,🄱,🅱,B,ᴮ,Ⓑ,๒,B,ɮ,Ᏸ,ც,๖,𝐁,𝗕,𝘉,𝘽,𝙱,B,в,ß,฿,乃,乃,𝖇,乃,𝓫,𝒷,𝕓,ｂ,𝒷,ʙ,🄱,🅱,b,ᵇ,ⓑ,๒,Ⴆ,ɮ,Ᏸ,ც,๖,𝐛,𝗯,𝘣,𝙗,𝚋,B,в,ß,฿,乃,乃,B,𝕭,𝙱,𝑩,𝚩,ꓐ,Β,В,𝜝,𝛣,𝖡,𝝗,𐊂,𐌁,𝗕,Ｂ,𝓑,𝞑,𝔅,ℬ,𝘉,𝘽,Ꞵ,Ᏼ,𝐁,ᗷ,𐊡,𝐵,𝔹,𝑏,𝗯,b,Ƅ,𝕓,𝖇,Ь,𝓫,𝚋,Ꮟ,ᖯ,𝔟,ᑲ,𝒃,𝘣,𝒷,𝙗,𝐛,𝖻,ദ,൫,♭,ḃ,ḅ,ḇ,b,ℬ,Ḃ,Ḅ,Ḇ,B,ß")
c::Send_random_char_from_array_string("ℭ,𝕮,𝓒,𝒞,ℂ,Ｃ,ᥴ,ᴄ,🄲,🅲,C,ᶜ,Ⓒ,ς,C,ƈ,ፈ,ƈ,¢,𝐂,𝗖,𝘊,𝘾,𝙲,ᄃ,¢,Ç,₵,匚,ᄃ,𝖈,Č,𝓬,𝒸,𝕔,ｃ,𝒸,ᴄ,x,🄲,x,🅲,c,ᶜ,ⓒ,ς,ƈ,ƈ,ፈ,ƈ,¢,𝐜,𝗰,𝘤,𝙘,𝚌,ᄃ,¢,¢,₵,匚,ᄃ,ℂ,𝕮,C,𝙲,𝑪,𝒞,𝖢,𐌂,𝗖,ꓚ,Ꮯ,𐔜,С,Ｃ,Ⲥ,𝓒,Ⅽ,ℭ,𝘊,𐐕,𝘾,🝌,𝐂,𑣲,𑣩,Ϲ,𐊢,𝐶,𝑐,𝗰,с,c,ｃ,𝕔,ᴄ,ⲥ,𐐽,𝖈,𝓬,𝚌,ꮯ,𝔠,ϲ,𝒄,𝘤,𝒸,𝙘,𝐜,𝖼,ⅽ,ç,ḉ,c,ℂ,ℭ,℃,₡,∁,C")
d::Send_random_char_from_array_string("𝔇,𝕯,𝓓,𝒟,𝔻,Ｄ,ᦔ,ժׁׅ݊,ᴅ,🄳,🅳,D,ᴰ,Ⓓ,D,ɖ,Ꮄ,ɖ,໓,𝐃,𝗗,𝘋,𝘿,𝙳,D,∂,Ð,Đ,ᗪ,り,𝖉,𝓓,𝓭,𝒹,𝕕,ｄ,𝒹,ᴅ,ʍ,🄳,w,🅳,d,ᵈ,ⓓ,๔,ԃ,ɖ,Ꮄ,ɖ,໓,𝐝,𝗱,𝘥,𝙙,𝚍,D,∂,Ð,Đ,ᗪ,り,Ꭰ,𝕯,D,ⅅ,𝓓,𝙳,𝔇,ᗪ,𝑫,𝘋,Ⅾ,𝒟,𝘿,ꓓ,𝐃,𝖣,𝐷,𝗗,𝔻,ᗞ,ԁ,𝓭,𝚍,d,ⅆ,𝑑,𝗱,Ꮷ,𝒅,𝘥,𝖉,ᑯ,ꓒ,𝐝,𝖽,𝔡,𝕕,ⅾ,𝒹,𝙙,ⅾ,ḋ,ḍ,ḏ,ḑ,ḓ,d,Ḓ,Ḋ,Ḍ,Ḏ,Ḑ,D")
e::Send_random_char_from_array_string("𝔈,𝕰,𝓔,𝐸,𝔼,Ｅ,ᴇ,🄴,🅴,ₑ,ᴱ,Ⓔ,є,E,ɛ,Ꮛ,ɛ,ē,𝐄,𝗘,𝘌,𝙀,𝙴,Σ,є,È,Ɇ,乇,乇,𝖊,乇,𝓮,𝑒,𝕖,ｅ,𝑒,ᴇ,ʌ,🄴,v,🅴,ₑ,ᵉ,ⓔ,є,ҽ,ɛ,Ꮛ,ɛ,ē,𝐞,𝗲,𝘦,𝙚,𝚎,Σ,є,ê,Ɇ,乇,乇,𝕰,𝙴,E,𝛦,𝑬,𝚬,𝜠,𝖤,Ε,Е,𝗘,𐊆,𝝚,𝓔,𝞔,Ｅ,𝔈,𝘌,Ꭼ,ℰ,𝙀,ꓰ,𑢮,𝐄,𝐸,ⴹ,𑢦,𝔼,⋿,𝓮,𝚎,e,ｅ,𝑒,𝗲,ⅇ,𝒆,𝘦,℮,𝖊,ℯ,𝐞,𝖾,ꬲ,е,𝔢,𝕖,ҽ,𝙚,ℯ,∊,€,ḕ,ḗ,ḙ,ḛ,ḝ,ẹ,ẻ,ẽ,ế,ề,ể,ễ,ệ,ἐ,ἑ,ἒ,ἓ,ἔ,ἕ,ὲ,έ,e,ℰ,ℇ,∃,Ḕ,Ḗ,Ḙ,Ḛ,Ḝ,Ẹ,Ẻ,Ẽ,Ế,Ề,Ể,Ễ,Ệ,Ὲ,Έ,Ἐ,Ἑ,Ἒ,Ἓ,Ἔ,Ἕ")
f::Send_random_char_from_array_string("𝔉,𝕱,𝓕,𝐹,𝔽,Ｆ,ᠻ,⨍,ꜰ,🄵,U,🅵,F,ᶠ,Ⓕ,Ŧ,F,ʄ,Ꭶ,ʄ,f,𝐅,𝗙,𝘍,𝙁,𝙵,F,ƒ,£,₣,千,ｷ,𝖋,𝒇,𝓯,𝒻,𝕗,ｆ,𝒻,ꜰ,n,🄵,u,🅵,f,ᶠ,ⓕ,Ŧ,ϝ,ʄ,Ꭶ,ʄ,f,𝐟,𝗳,𝘧,𝙛,𝚏,F,ƒ,£,₣,千,ｷ,𝑭,𝈓,F,𝕱,𑢢,𝖥,Ꞙ,𝓕,Ϝ,𐊇,ꓝ,𝗙,𐔥,𝘍,𑣂,𝐅,𝟊,𝔉,ℱ,𝔽,ᖴ,𝙁,𝙵,𐊥,𝐹,𝓯,𝚏,ք,𝑓,𝗳,f,𝒇,𝘧,𝖋,𝐟,𝖿,𝔣,ꬵ,𝕗,ꞙ,𝒻,𝙛,ẝ,ſ,ḟ,ƒ,f,ℱ,Ḟ,₣,℉,F")
g::Send_random_char_from_array_string("𝔊,𝕲,𝓖,𝒢,𝔾,Ｇ,ᧁ,ᧁׁ,ɢ,🄶,T,🅶,G,ᴳ,Ⓖ,G,ɢ,Ꮆ,ɠ,ງ,𝐆,𝗚,𝘎,𝙂,𝙶,G,g,G,₲,Ꮆ,𝖌,Ğ,𝓰,𝑔,𝕘,ｇ,𝑔,ɢ,ʇ,🄶,ƚ,🅶,g,ᵍ,ⓖ,ﻮ,ɠ,ɢ,Ꮆ,ɠ,ງ,𝐠,𝗴,𝘨,𝙜,𝚐,G,g,g,₲,Ꮆ,ム,Ꮐ,𝑮,𝘎,𝕲,G,𝐆,𝖦,Ԍ,𝔊,𝔾,Ᏻ,𝒢,𝙂,ꓖ,𝓖,𝙶,𝐺,𝗚,𝓰,𝚐,ɡ,ց,ᶃ,𝑔,𝗴,g,ｇ,𝒈,𝘨,ℊ,𝖌,ƍ,𝐠,𝗀,𝔤,𝕘,𝙜,❡,ḡ,ℊ,g,ℊ,Ḡ,G")
h::Send_random_char_from_array_string("ℌ,𝕳,𝓗,𝐻,ℍ,Ｈ,hׁׅ֮,ʜ,S,🄷,🅷,ₕ,ᴴ,Ⓗ,ђ,H,ɦ,Ꮒ,ɧ,h,𝐇,𝗛,𝘏,𝙃,𝙷,Ή,н,H,Ⱨ,卄,ん,𝖍,ｈ,𝓱,𝒽,𝕙,ｈ,𝒽,ʜ,s,🄷,ꙅ,🅷,ₕ,ʰ,ⓗ,ђ,ԋ,ɦ,Ꮒ,ɧ,h,𝐡,𝗵,𝘩,𝙝,𝚑,Ή,н,h,Ⱨ,卄,ん,𝑯,𝚮,𝕳,H,𝛨,𝖧,ℋ,ℌ,ℍ,Ⲏ,𐋏,𝜢,Η,𝓗,𝞖,𝝜,𝗛,Н,𝘏,ꓧ,Ｈ,𝐇,𝙃,𝙷,Ꮋ,ᕼ,𝐻,Ꮒ,𝖍,𝓱,𝚑,h,ｈ,𝔥,ℎ,𝒉,𝘩,հ,𝒽,𝙝,𝐡,𝗁,𝗵,һ,𝕙,ⓗ,⒣,ℎ,ℏ,ℌ,ḣ,ḥ,ḧ,ḩ,ḫ,ẖ,h,ℋ,ℍ,Ḣ,Ḥ,Ḧ,Ḩ,Ḫ,Ἠ,Ħ,Ἡ,Ἢ,Ἣ,Ἤ,Ἥ,Ἦ,Ἧ,ᾘ,ᾙ,ᾚ,ᾛ,ᾜ,ᾝ,ᾞ,ᾟ,Ὴ,Ή,ῌ,H")
ı::Send_random_char_from_array_string("ℑ,𝕴,𝓘,𝐼,𝕀,Ｉ,꠸,ɪ,ᴚ,🄸,Я,ᵢ,ᴵ,Ⓘ,เ,I,ɨ,Ꭵ,ı,i,𝐈,𝗜,𝘐,𝙄,𝙸,I,ι,Ì,ł,丨,ﾉ,𝖎,Ɨ,𝓲,𝒾,𝕚,ｉ,𝒾,ɪ,ɹ,🄸,ɿ,🅸,ᵢ,ⁱ,ⓘ,เ,ι,ɨ,Ꭵ,ı,i,𝐢,𝗶,𝘪,𝙞,𝚒,I,ι,ï,ł,丨,ﾉ,𝚰,𝘭,І,𝖨,𝐥,ﺍ,ﺎ,𝔩,ℐ,ℑ,𐊊,Ⲓ,𐌉,ℓ,𝜤,Ɩ,𝞘,Ι,𝚕,𝟏,∣,ا,Ｉ,𝗅,𝕀,1,𝙄,𝓁,𐌠,𝐼,𝑰,ǀ,Ӏ,ᛁ,𝟭,𝕴,I,ߊ,ｌ,𝛪,ⵏ,𝝞,𝕝,𝟣,ו,𞣇,𝙡,𝓘,𝗜,𝟙,𝑙,ן,Ⅰ,𝘐,١,𝒍,𝖑,￨,𝐈,l,۱,ꓲ,𖼨,𝙸,𝟷,𝓵,|,ⅼ,⏽,𝗹,𝓲,𝞲,ꙇ,ⅈ,ｉ,𝔦,𝘪,ӏ,𝙞,𝚤,𝐢,і,𝑖,˛,𝕚,𝖎,Ꭵ,𝚒,𑣃,i,ɩ,ɪ,𝒊,𝛊,ⅰ,ı,𝒾,𝜾,⍳,𝜄,ꭵ,𝗂,𝝸,ℹ,ι,𝗶,ͺ,ї,유,ḭ,ḯ,ỉ,ị,ἰ,ἱ,ἲ,ἳ,ἴ,ἵ,ἶ,ἷ,ῐ,ῑ,ῒ,ΐ,ῖ,ῗ,ὶ,ί,i,Ї,ℐ,Ḭ,ḭ,Ḯ,ḯ,Ỉ,ỉ,Ị,ị,ἰ,ἱ,ἲ,ἳ,ἴ,ἵ,ἶ,ἷ,Ἰ,Ἱ,Ἲ,Ἳ,Ἴ,Ἵ,Ἶ,Ἷ,ῐ,ῑ,ῒ,ΐ,ῖ,ῗ,Ῐ,Ῑ,Ὶ,Ί,ὶ,ί,I")
j::Send_random_char_from_array_string("𝔍,𝕵,𝓙,𝒥,𝕁,Ｊ,꠹,յׁׅ,ᴊ,🄹,🅹,ⱼ,ᴶ,Ⓙ,ן,J,ʝ,Ꮰ,ʝ,ว,𝐉,𝗝,𝘑,𝙅,𝙹,J,נ,J,J,ﾌ,ﾌ,𝖏,Ĵ,𝓳,𝒿,𝕛,ｊ,𝒿,ᴊ,b,🄹,p,🅹,ⱼ,ʲ,ⓙ,ן,ʝ,ʝ,Ꮰ,ʝ,ว,𝐣,𝗷,𝘫,𝙟,𝚓,J,נ,j,J,ﾌ,ﾌ,𝔍,𝑱,𝘑,Ј,J,Ｊ,𝒥,𝙅,Ꭻ,ᒍ,𝐉,𝖩,Ʝ,𝐽,𝗝,𝕁,ꓙ,𝕵,𝓙,𝙹,Ϳ,𝖏,𝓳,𝚓,ⅉ,𝔧,j,ｊ,𝒋,𝘫,𝒿,𝙟,ϳ,𝐣,𝗃,ј,𝑗,𝗷,𝕛,ʝ,♩,j,J")
k::Send_random_char_from_array_string("𝔎,𝕶,𝓚,𝒦,𝕂,Ｋ,ᛕ,ƙׁׅ֑,ᴋ,🄺,ꟼ,🅺,ₖ,ᴷ,Ⓚ,к,K,ӄ,Ꮶ,ƙ,k,𝐊,𝗞,𝘒,𝙆,𝙺,K,к,K,₭,Ҝ,ズ,𝖐,ᵏ,𝓴,𝓀,𝕜,ｋ,𝓀,ᴋ,d,🄺,q,🅺,ₖ,ᵏ,ⓚ,к,ƙ,ӄ,Ꮶ,ƙ,k,𝐤,𝗸,𝘬,𝙠,𝚔,K,к,k,₭,Ҝ,ズ,𝑲,𝚱,𝒦,K,𝜥,𝛫,𝖪,𝝟,𝗞,Ⲕ,ᛕ,ꓗ,Κ,К,𝓚,𝞙,𝔎,𝘒,Ꮶ,𝙆,Ｋ,𐔘,𝐊,𝐾,𝕂,𝕶,𝙺,𝖐,𝓴,𝚔,𝔨,k,𝒌,𝘬,𝓀,𝙠,𝐤,𝗄,𝑘,𝗸,𝕜,к,ḱ,ḳ,ḵ,k,₭,Ḱ,Ḳ,Ḵ,K")
l::Send_random_char_from_array_string("𝔏,𝕷,𝓛,𝐿,𝕃,Ｌ,ᥣׁׅ֪,ʟ,🄻,O,🅻,ᴸ,Ⓛ,ɭ,L,ʟ,Ꮭ,Ɩ,l,𝐋,𝗟,𝘓,𝙇,𝙻,ᄂ,ℓ,L,Ⱡ,ㄥ,ﾚ,𝖑,ᒪ,𝓵,𝓁,𝕝,ｌ,𝓁,ʟ,o,🄻,o,🅻,ₗ,ˡ,ⓛ,ɭ,ʅ,ʟ,Ꮭ,Ɩ,l,𝐥,𝗹,𝘭,𝙡,𝚕,ᄂ,ℓ,l,Ⱡ,ㄥ,ﾚ,𖼖,𝑳,𑢣,L,𝖫,Ⳑ,𝗟,ℒ,𝓛,Ꮮ,𐔦,𝔏,ꓡ,𐐛,𝘓,𝙇,ᒪ,Ⅼ,𝈪,𝐋,𝐿,𝕃,𑢲,𝕷,𝙻,𝚰,𝘭,І,𝖨,𝐥,ﺍ,ﺎ,𝔩,ℐ,ℑ,𐊊,Ⲓ,𐌉,ℓ,𝜤,Ɩ,𝞘,Ι,𝚕,𝟏,∣,ا,Ｉ,𝗅,𝕀,1,𝙄,𝓁,𐌠,𝐼,𝑰,ǀ,Ӏ,ᛁ,𝟭,𝕴,I,ߊ,ｌ,𝛪,ⵏ,𝝞,𝕝,𝟣,ו,𞣇,𝙡,𝓘,𝗜,𝟙,𝑙,ן,Ⅰ,𝘐,١,𝒍,𝖑,￨,𝐈,l,۱,ꓲ,𖼨,𝙸,𝟷,𝓵,|,ⅼ,⏽,𝗹,ℓ,ḻ,ḽ,l,ℒ,₤,Ḷ,Ḹ,Ḻ,Ḽ,L")
m::Send_random_char_from_array_string("𝔐,𝕸,𝓜,𝑀,𝕄,Ｍ,ᴍ,N,🄼,🅼,ₘ,ᴹ,Ⓜ,๓,M,ʍ,Ꮇ,ɱ,๓,𝐌,𝗠,𝘔,𝙈,𝙼,M,м,M,₥,爪,ﾶ,𝖒,ⓜ,𝓶,𝓂,𝕞,ｍ,𝓂,ᴍ,u,🄼,ᴎ,🅼,ₘ,ᵐ,ⓜ,๓,ɱ,ʍ,Ꮇ,ɱ,๓,𝐦,𝗺,𝘮,𝙢,𝚖,M,м,m,₥,爪,ﾶ,𝛭,𝑴,𝚳,𝜧,𐌑,𝖬,M,𝗠,ᛖ,𝝡,Ⲙ,𝓜,Μ,М,𝞛,ꓟ,𝔐,𝘔,𝙈,𐊰,𝐌,Ｍ,Ⅿ,𝑀,ᗰ,ℳ,𝕄,Ꮇ,𝕸,Ϻ,𝙼,𑜀,𝒎,𝘮,𑣣,𝖒,𝐦,𝗆,m,𝔪,𝕞,𝓂,𝙢,𝓶,𝚖,𝑚,𝗺,ⅿ,Պ,ṃ,ḿ,ṁ,m,Ḿ,Ṁ,Ṃ,M,സ,൬,ന,ണ,൩")
n::Send_random_char_from_array_string("𝔑,𝕹,𝓝,𝒩,ℕ,Ｎ,ɴ,🄽,M,🅽,ₙ,ᴺ,Ⓝ,ภ,N,ռ,Ꮑ,ŋ,ຖ,𝐍,𝗡,𝘕,𝙉,𝙽,П,η,ñ,₦,几,刀,𝖓,𝓃,𝓷,𝓃,𝕟,ｎ,𝓃,ɴ,ɯ,🄽,m,🅽,ₙ,ⁿ,ⓝ,ภ,ɳ,ռ,Ꮑ,ŋ,ຖ,𝐧,𝗻,𝘯,𝙣,𝚗,П,η,ñ,₦,几,刀,ꓠ,𝛮,𝐍,𝖭,𝚴,𝔑,𝜨,𐔓,N,Ｎ,𝒩,𝙉,𝓝,𝙽,ℕ,𝝢,𝑁,𝗡,Ⲛ,𝑵,𝘕,𝞜,Ν,𝕹,𝒏,𝘯,𝖓,𝐧,𝗇,𝔫,n,𝕟,𝓃,𝙣,ո,𝓷,𝚗,ռ,𝑛,𝗻,η,ℵ,ṅ,ṇ,ṉ,ṋ,ἠ,ἡ,ἢ,ἣ,ἤ,ἥ,ἦ,ἧ,ὴ,ή,ᾐ,ᾑ,ᾒ,ᾓ,ᾔ,ᾕ,ᾖ,ᾗ,ῂ,ῃ,ῄ,ῆ,ῇ,n,ℕ,₦,Ṅ,Ṇ,Ṉ,Ṋ,N")
o::Send_random_char_from_array_string("𝔒,𝕺,𝓞,𝒪,𝕆,Ｏ,ᴏ,🄾,🅾,ₒ,ᴼ,Ⓞ,๏,O,օ,Ꭷ,ơ,໐,𝐎,𝗢,𝘖,𝙊,𝙾,Ө,σ,Ö,Ø,ㄖ,の,𝖔,ᗝ,𝓸,𝑜,𝕠,ｏ,❀,ᴏ,🄾,|,🅾,ₒ,ᵒ,ⓞ,๏,σ,օ,Ꭷ,ơ,໐,𝐨,𝗼,𝘰,𝙤,𝚘,Ө,σ,ð,Ø,ㄖ,の,߀,𝛰,𑣠,𝖮,〇,𐊒,𝟬,𝒪,𝜪,O,ዐ,𝓞,𝞞,𝝤,ⵔ,Օ,𝟢,𝗢,𝟘,𝘖,Ⲟ,О,Ο,ଠ,𝟎,𝐎,০,୦,𝔒,🯰,𝕆,𝙊,𐔖,Ｏ,0,𑓐,𐊫,𝙾,ꓳ,𑢵,𝑂,𐐄,𝟶,𝑶,𝚶,𐓂,𝕺,𝘰,ం,ಂ,ം,ං,օ,𝐨,𑣗,𝔬,ᴏ,ᴑ,𐓪,𝚘,𑣈,ဝ,ⲟ,𝛐,ഠ,𝛔,𝗈,𝝈,ℴ,𝝄,𝞸,𝞼,ꬽ,о,ο,၀,ہ,σ,ه,ｏ,๐,໐,𝕠,𐐬,𝙤,ە,𝑜,𝒐,ס,𝜎,𝖔,٥,०,੦,૦,௦,౦,೦,൦,𝜊,o,𝝾,۵,𝞂,𝓸,𝗼,ჿ,⍥,ṍ,ṏ,ṑ,ṓ,ọ,ỏ,ố,ồ,ổ,ỗ,ớ,ờ,ở,ỡ,ợ,ὀ,ὁ,ὂ,ὃ,ὄ,ὅ,ộ,o,Ṍ,Ṏ,Ṑ,Ṓ,Ọ,Ỏ,Ố,Ồ,Ổ,Ỗ,Ộ,Ớ,Ờ,Ở,Ỡ,Ợ,Ὀ,Ὁ,Ὂ,Ὃ,Ὄ,O")
p::Send_random_char_from_array_string("𝔓,𝕻,𝓟,𝒫,ℙ,Ｐ,ρ,ᴘ,🄿,🅿,ₚ,ᴾ,Ⓟ,ק,P,ք,Ꭾ,℘,p,𝐏,𝗣,𝘗,𝙋,𝙿,P,ρ,þ,₱,卩,ｱ,𝖕,ℙ,𝓹,𝓅,𝕡,ｐ,𝓅,ᴘ,🄿,ʞ,🅿,ₚ,ᵖ,ⓟ,ק,ρ,ք,Ꭾ,℘,p,𝐩,𝗽,𝘱,𝙥,𝚙,P,ρ,þ,₱,卩,ｱ,𝖯,𝛲,𝝦,𝜬,𝒫,𐊕,P,𝞠,𝓟,ꓑ,𝗣,ℙ,𝘗,Р,𝐏,Ρ,Ⲣ,Ꮲ,𝙋,ᑭ,Ｐ,𝙿,𝑃,𝚸,𝑷,р,ρ,𝔭,𝘱,𝙥,𝐩,ｐ,𝛠,𝑝,𝕡,𝖕,𝜚,𝚙,𝞎,ⲣ,𝝔,𝛒,𝒑,𝟈,𝝆,𝓅,𝜌,𝗉,p,𝞀,ϱ,𝗽,⍴,𝞺,𝓹,℘,ṗ,ṕ,ῥ,ῤ,p,ℙ,Ṗ,Ῥ,Ṕ,P")
q::Send_random_char_from_array_string("𝔔,𝕼,𝓠,𝒬,ℚ,Ｑ,℘,Q,🅀,Ⴑ,🆀,Q,Q,Ⓠ,ợ,Q,զ,Ꭴ,զ,๑,𝐐,𝗤,𝘘,𝙌,𝚀,Q,q,Q,Q,Ɋ,ゐ,𝖖,Ǫ,𝓺,𝓆,𝕢,ｑ,𝓆,Q,ɾ,🅀,ꞁ,🆀,q,q,ⓠ,ợ,ϙ,զ,Ꭴ,զ,๑,𝐪,𝗾,𝘲,𝙦,𝚚,Q,q,q,Q,Ɋ,ゐ,𝐐,𝖰,𝔔,𝒬,𝙌,𝓠,𝚀,Q,𝑄,𝗤,ⵕ,𝑸,𝘘,ℚ,𝕼,𝔮,գ,𝒒,𝘲,զ,𝓆,𝙦,𝐪,𝗊,q,𝑞,𝗾,𝕢,𝖖,ԛ,𝓺,𝚚,ҩ,ǭ,q,ℚ,Ǭ,Q")
r::Send_random_char_from_array_string("ℜ,𝕽,𝓡,𝑅,ℝ,Ｒ,᥅,qׁׅ,ʀ,🅁,🆁,ᵣ,ᴿ,Ⓡ,г,R,ʀ,Ꮢ,r,𝐑,𝗥,𝘙,𝙍,𝚁,Я,я,R,Ɽ,尺,尺,𝖗,ŕ,𝓻,𝓇,𝕣,ｒ,𝓇,ʀ,🅁,🆁,ᵣ,ʳ,ⓡ,г,ɾ,ʀ,Ꮢ,r,𝐫,𝗿,𝘳,𝙧,𝚛,Я,я,r,Ɽ,尺,尺,Ꭱ,𖼵,𝙍,ꓣ,Ʀ,𝐑,𝖱,ᖇ,𐒴,𝑅,𝗥,R,Ꮢ,𝕽,𝓡,𝚁,𝈖,ℛ,ℜ,ℝ,𝑹,𝘙,𝔯,ꮁ,𝒓,𝘳,ⲅ,ᴦ,ꭇ,ꭈ,𝓇,𝙧,𝐫,𝗋,𝑟,𝗿,r,г,𝕣,𝖗,𝓻,𝚛,Ի,ṟ,ṙ,ṛ,ṝ,r,ℛ,ℜ,ℝ,℟,Ṙ,Ṛ,Ṝ,Ṟ,R")
s::Send_random_char_from_array_string("𝓢,𝒮,𝕊,Ｓ,ᦓ,ꜱ,,🆂,ₛ,ˢ,Ⓢ,ร,S,ֆ,Ꮥ,ʂ,Ş,𝐒,𝗦,𝘚,𝙎,𝚂,Ƨ,ѕ,§,₴,丂,丂,𝖘,s,𝓼,𝓈,𝕤,ｓ,𝓈,ꜱ,ɥ,🅂,ʜ,🆂,ₛ,ˢ,ⓢ,ร,ʂ,ֆ,Ꮥ,ʂ,Ş,𝐬,𝘀,𝘴,𝙨,𝚜,Ƨ,ѕ,§,₴,丂,丂𝒮,𝙎,ꓢ,𖼺,𐐠,Ѕ,𝐒,𝖲,𝑆,𝗦,𐊖,𝕊,Տ,𝕾,S,Ｓ,Ꮥ,𝓢,𝚂,𝔖,Ꮪ,𝑺,𝘚,𝔰,𑣁,𝒔,𝘴,𝓈,𝙨,ꮪ,𝐬,𝗌,𝑠,𝘀,ꜱ,s,ｓ,𝕤,ѕ,𝖘,𝓼,𝚜,𐑈,ƽ,ട,ഗ,ṡ,ṣ,ṥ,ṧ,ṩ,ş,﹩,s,Š,Ṡ,Ṣ,Ṥ,Ṧ,Ṩ,S,$")
t::Send_random_char_from_array_string("𝔗,𝕿,𝓣,𝒯,𝕋,Ｔ,ᴛ,🅃,🆃,ₜ,ᵀ,Ⓣ,Շ,T,ȶ,Ꮦ,ɬ,t,𝐓,𝗧,𝘛,𝙏,𝚃,Ƭ,т,†,₮,ㄒ,ｲ,𝖙,Ｔ,𝓽,𝓉,𝕥,ｔ,𝓉,ᴛ,ɓ,🅃,ǫ,🆃,ₜ,ᵗ,ⓣ,Շ,ƚ,ȶ,Ꮦ,ɬ,t,𝐭,𝘁,𝘵,𝙩,𝚝,Ƭ,т,†,₮,ㄒ,ｲ,𝒯,𝜯,𝖳,𝗧,𐊗,𐌕,𝝩,🝨,T,ꓔ,𖼊,𝓣,𝞣,⟙,𝔗,𝘛,𝙏,Т,Ꭲ,⊤,Τ,𝐓,Ⲧ,𝑇,𐊱,𝕋,𑢼,𝕿,Ｔ,𝚃,𝛵,𝑻,𝚻,𝐭,𝗍,𝔱,𝕥,𝓉,𝙩,𝓽,𝚝,t,𝑡,𝘁,𝒕,𝘵,𝖙,ṫ,ṭ,ṯ,ṱ,ẗ,†,t,₮,Ṫ,Ṭ,Ṯ,Ṱ,T,₺")
u::Send_random_char_from_array_string("𝔘,𝖀,𝓤,𝒰,𝕌,Ｕ,ᴜ,🅄,ꟻ,🆄,ᵤ,ᵁ,Ⓤ,ย,U,ʊ,ų,น,𝐔,𝗨,𝘜,𝙐,𝚄,Ц,υ,Ú,Ʉ,ㄩ,ひ,𝖚,ᵘ,𝓾,𝓊,𝕦,ｕ,𝓊,ᴜ,ɟ,🅄,Ꮈ,🆄,ᵤ,ᵘ,ⓤ,ย,υ,ʊ,Ꮼ,ų,น,𝐮,𝘂,𝘶,𝙪,𝚞,Ц,υ,µ,Ʉ,ㄩ,ひ,𝒰,𝙐,ሀ,⋃,𝐔,𝖴,𝑈,𝗨,𑢸,∪,𝕌,ᑌ,Ս,𝖀,𝓤,𝚄,ꓴ,U,𐓎,𝔘,𝑼,𝘜,𖽂,𝐮,υ,𝔲,𑣘,𝕦,ʋ,𝙪,ꭎ,𐓶,𝚞,ꭒ,𝑢,𝒖,𝛖,ᴜ,𝖚,ꞟ,𝜐,𝗎,𝓊,𝝊,𝓾,𝞾,𝞄,u,𝘂,𝘶,ս,υ,ṳ,ṵ,ṷ,ṹ,ṻ,ụ,ủ,ứ,ừ,ử,ữ,ự,ὐ,ὑ,ὒ,ὓ,ὔ,ὕ,ὖ,ὗ,ὺ,ύ,ῠ,ῡ,ῢ,ΰ,ῦ,ῧ,u,Ṳ,Ụ,Ủ,Ứ,Ừ,Ử,Ữ,Ự,Ṷ,Ṹ,Ṻ,Ṵ,U")
v::Send_random_char_from_array_string("𝓥,𝒱,𝕍,Ｖ,υׁׅ,ᴠ,🅅,🆅,ᵥ,ⱽ,Ⓥ,V,ʋ,Ꮙ,۷,ง,𝐕,𝗩,𝘝,𝙑,𝚅,V,ν,V,V,ᐯ,√,𝖛,𝐯,𝓿,𝓋,𝕧,ｖ,𝓋,ᴠ,ǝ,🅅,ɘ,🆅,ᵥ,ᵛ,ⓥ,ש,ʋ,ʋ,Ꮙ,۷,ง,𝐯,𝘃,𝘷,𝙫,𝚟,V,ν,v,V,ᐯ,√,𑢠,𝈍,𝒱,𝓥,𝗩,𝘝,V,𖼈,Ꮩ,𝐕,𝔙,ꛟ,𝕍,Ⅴ,ꓦ,٧,𝙑,𐔝,𝚅,𝑉,ᐯ,𝑽,Ѵ,۷,𝖁,ⴸ,𝖵,⋁,𝐯,𝔳,𝕧,𝙫,𝚟,𝑣,ｖ,ט,𝒗,𝖛,ᴠ,𝗏,𑣀,𝛎,∨,𝜈,ꮩ,𝓋,𝓿,ⅴ,𝘃,ѵ,v,𝝂,𝘷,𝞶,𑜆,𝝼,ν,ṽ,ṿ,v,Ṽ,Ṿ,V")
w::Send_random_char_from_array_string("𝓦,𝒲,𝕎,Ｗ,᭙,ᴡ,🅆,🆆,W,ᵂ,Ⓦ,ฬ,W,ա,Ꮗ,ῳ,ຟ,𝐖,𝗪,𝘞,𝙒,𝚆,Щ,ω,W,₩,山,W,𝖜,𝔴,𝔀,𝓌,𝕨,ｗ,𝓌,ᴡ,p,🅆,b,🆆,w,ʷ,ⓦ,ฬ,ɯ,ա,Ꮗ,ῳ,ຟ,𝐰,𝘄,𝘸,𝙬,𝚠,Щ,ω,w,₩,山,W,𝕎,𝒲,𝙒,𝓦,𝚆,ꓪ,𝑊,𝗪,𑣯,𝑾,𝘞,Ꮃ,Ꮤ,𝖂,W,𝐖,𝖶,𑣦,Ԝ,𝔚,𝐰,𝗐,ᴡ,ѡ,ա,ꮃ,𝔴,𝕨,𝓌,𝙬,ɯ,𝔀,𝚠,𑜏,𑜎,𝑤,𝘄,w,𝒘,𝘸,𝖜,ԝ,𑜊,ഡ,ധ,ω,ẁ,ẃ,ẅ,ẇ,ẉ,ẘ,ὠ,ὡ,ὢ,ὣ,ὤ,ὥ,ὦ,ὧ,ὼ,ώ,ᾠ,ᾡ,ᾢ,ᾣ,ᾤ,ᾥ,ᾦ,ᾧ,ῲ,ῳ,ῴ,ῶ,ῷ,w,₩,Ẁ,Ẃ,Ẅ,Ẇ,Ẉ,W")
x::Send_random_char_from_array_string("𝔛,𝖃,𝓧,𝒳,𝕏,Ｘ,᥊,x,🅇,🆇,ₓ,ˣ,Ⓧ,א,X,Ӽ,ጀ,ҳ,x,𝐗,𝗫,𝘟,𝙓,𝚇,X,χ,×,Ӿ,乂,ﾒ,𝖝,Ж,𝔁,𝓍,𝕩,ｘ,𝓍,x,ɔ,🅇,ɔ,🆇,ₓ,ˣ,ⓧ,א,x,Ӽ,ጀ,ҳ,x,𝐱,𝘅,𝘹,𝙭,𝚡,X,χ,x,Ӿ,乂,ﾒ,𝒳,𝜲,𝓧,𝞦,𐊐,𝝬,𐌗,𝗫,𝘟,X,𝐗,𝔛,ⵝ,𐔧,𝕏,𝙓,Х,Χ,Ⅹ,𝚇,ꓫ,Ⲭ,᙭,𝑋,𐊴,𝑿,𝚾,╳,Ꭓ,𝖃,ᚷ,Ｘ,𝛸,𐌢,𝖷,𑣬,ᕁ,𝓍,𝙭,х,𝐱,𝗑,⤫,𝑥,𝘅,⤬,᙮,⨯,𝕩,𝖝,×,𝔁,𝚡,x,ｘ,ⅹ,𝔵,ᕽ,𝒙,𝘹,✗,✘,ẋ,ẍ,x,Ẍ,Ẋ,X")
y::Send_random_char_from_array_string("𝔜,𝖄,𝓨,𝒴,𝕐,Ｙ,᥊ׁׅ,ᙠ,🅈,ᙠ,🆈,Y,ʸ,Ⓨ,ץ,Y,ʏ,Ꭹ,ყ,ฯ,𝐘,𝗬,𝘠,𝙔,𝚈,Y,у,¥,Ɏ,ㄚ,ﾘ,𝓨,𝔂,𝓎,𝕪,ｙ,𝓎,ʏ,q,🅈,d,🆈,y,ʸ,ⓨ,ץ,ყ,ʏ,Ꭹ,ყ,ฯ,𝐲,𝘆,𝘺,𝙮,𝚢,Y,у,¥,Ɏ,ㄚ,ﾘ,𝜰,𝒴,𑢤,𝓨,𝗬,𝝪,𝘠,ϒ,𖽃,𝞤,𝐘,Y,𝔜,𝕐,У,𝙔,Υ,𝚈,Ⲩ,Ꭹ,𐊲,𝑌,ꓬ,Ү,𝒀,𝖄,𝖸,Ｙ,𝛶,𝚼,Ꮍ,𝙮,у,𝐲,𝝲,𝑦,ᶌ,𝞬,𑣜,𝕪,ʏ,𝖞,𝚢,ｙ,ꭚ,𝒚,𝓎,ɣ,𝗒,ყ,𝘆,ү,𝛾,γ,𝛄,𝔂,𝜸,y,𝔶,ℽ,𝘺,ỿ,ỵ,ỷ,ỹ,ẏ,y,ㄚ,Ẏ,Ὑ,Ὓ,Ὕ,Ὗ,Ῠ,Ῡ,Ὺ,Ύ,Ỳ,Ỵ,Ỷ,Ỹ,Y,ⓨ,൮,⑂,ഴ,ẙ,ỳ")
z::Send_random_char_from_array_string("ℨ,𝖅,𝓩,𝒵,ℤ,Ｚ,ƺ,ᴢ,∀,🅉,A,🆉,Z,ᶻ,Ⓩ,չ,Z,ʐ,ፚ,ʑ,ຊ,𝐙,𝗭,𝘡,𝙕,𝚉,Z,z,Z,Ⱬ,乙,乙,𝖟,z,𝔃,𝓏,𝕫,ｚ,𝓏,ᴢ,ɐ,🅉,ɒ,🆉,z,ᶻ,ⓩ,չ,ȥ,ʐ,ፚ,ʑ,ຊ,𝐳,𝘇,𝘻,𝙯,𝚣,Z,z,z,Ⱬ,乙,乙,𝗭,𝚭,Ꮓ,𑣥,𝛧,𝓩,Ζ,𝘡,𝜡,Z,𝙕,𝞕,ꓜ,𝝛,𝐙,𝑍,ℤ,ℨ,𝖅,𑢩,Ｚ,𝒵,𝖹,𝓏,𝙯,ᴢ,𝐳,𝗓,𑣄,𝑧,𝘇,𝕫,𝖟,ꮓ,𝔃,𝚣,𝔷,z,𝒛,𝘻,ℨ,ẑ,ẓ,ẕ,z,Ž,ℤ,Ẑ,Ẕ,Ẓ,Z")
0::Send_random_char_from_array_string("𝛰,𑣠,𝖮,〇,𐊒,𝟬,𝒪,𝜪,O,ዐ,𝓞,𝞞,𝝤,ⵔ,Օ,𝟢,𝗢,𝟘,𝘖,Ⲟ,О,Ο,ଠ,𝟎,𝐎,০,୦,𝔒,🯰,𝕆,𝙊,𐔖,Ｏ,0,𑓐,𐊫,𝙾,ꓳ,𑢵,𝑂,𐐄,𝟶,𝑶,𝚶,𐓂,𝕺,∅")
1::Send_random_char_from_array_string("𝚰,𝘭,І,𝖨,𝐥,ﺍ,ﺎ,𝔩,ℐ,ℑ,𐊊,Ⲓ,𐌉,ℓ,𝜤,Ɩ,𝞘,Ι,𝚕,𝟏,∣,ا,Ｉ,𝗅,𝕀,1,𝙄,𝓁,𐌠,𝐼,׀,𝑰,ǀ,Ӏ,ᛁ,𝟭,𝕴,I,ߊ,ｌ,𝛪,ⵏ,𝝞,𝕝,𝟣,ו,𞣇,𝙡,𝓘,𝗜,𝟙,𝑙,ן,Ⅰ,𝘐,١,𝒍,𝖑,￨,𝐈,l,۱,ꓲ,𖼨,𝙸,𝟷,𝓵,|,ⅼ,⏽,𝗹,ⅼ")
2::Send_random_char_from_array_string("𝟐,𝟮,Ꙅ,Ƨ,Ϩ,ꛯ,2,𝟤,𝟸,Ꝛ,𝟚,ᒿ,Ⅱ")
3::Send_random_char_from_array_string("Ӡ,𝟯,𝟑,𝈆,Ꝫ,𝟥,Ɜ,Ⳍ,3,Ʒ,З,𖼻,Ȝ,𝟛,𝟹,𑣊,Ⅲ")
4::Send_random_char_from_array_string("𝟰,𑢯,4,𝟒,𝟦,𝟜,𝟺,Ꮞ,Ⅳ")
5::Send_random_char_from_array_string("𝟝,5,𝟓,𝟱,𝟧,Ƽ,𝟻,𑢻,Ⅴ")
6::Send_random_char_from_array_string("б,𝟞,Ⳓ,𝟔,𑣕,6,𝟲,𝟨,𝟼,Ꮾ,Ⅵ")
7::Send_random_char_from_array_string("𝟟,𝟽,𝈒,𝟳,7,𐓒,𝟕,𑣆,𝟩,Ⅶ")
8::Send_random_char_from_array_string("𐌚,Ȣ,ଃ,ȣ,𝟴,৪,੪,𞣋,𝟪,𝟠,𝟾,8,𝟖,Ⅷ")
9::Send_random_char_from_array_string("੧,୨,Ⳋ,𑣖,৭,൭,𝟫,Ꝯ,𝟿,𝟡,9,𝟗,𝟵,𑣌,𑢬,Ⅸ")

; -----------------------------------------------------

CapsLock::Suspend
!CapsLock::Reload

; -----------------------------------------------------

; https://lingojam.com/TextSymbols(Letters) (no wingdings, zalgo, spaced)
; 𝔄,𝕬,𝓐,𝒜,𝔸,Ａ,ꪖ,ɑׁׅ֮,ᴀ,Z,🄰,Ƹ,🅰,ₐ,ᴬ,Ⓐ,ค,A,ǟ,Ꮧ,ą,ค,𝐀,𝗔,𝘈,𝘼,𝙰,Λ,α,Ä,₳,卂,ﾑ
; 𝔅,𝕭,𝓑,𝐵,𝔹,Ｂ,᥇,ϐׁׅ֒,ʙ,⅄,🄱,Y,🅱,B,ᴮ,Ⓑ,๒,B,ɮ,Ᏸ,ც,๖,𝐁,𝗕,𝘉,𝘽,𝙱,B,в,ß,฿,乃,乃
; ℭ,𝕮,𝓒,𝒞,ℂ,Ｃ,ᥴ,ᝯׁ,ᴄ,X,🄲,X,🅲,C,ᶜ,Ⓒ,ς,C,ƈ,ፈ,ƈ,¢,𝐂,𝗖,𝘊,𝘾,𝙲,ᄃ,¢,Ç,₵,匚,ᄃ
; 𝔇,𝕯,𝓓,𝒟,𝔻,Ｄ,ᦔ,ժׁׅ݊,ᴅ,M,🄳,W,🅳,D,ᴰ,Ⓓ,๔,D,ɖ,Ꮄ,ɖ,໓,𝐃,𝗗,𝘋,𝘿,𝙳,D,∂,Ð,Đ,ᗪ,り
; 𝔈,𝕰,𝓔,𝐸,𝔼,Ｅ,ꫀ,ꫀׁׅܻ,ᴇ,Λ,🄴,V,🅴,ₑ,ᴱ,Ⓔ,є,E,ɛ,Ꮛ,ɛ,ē,𝐄,𝗘,𝘌,𝙀,𝙴,Σ,є,È,Ɇ,乇,乇
; 𝔉,𝕱,𝓕,𝐹,𝔽,Ｆ,ᠻ,⨍,ꜰ,∩,🄵,U,🅵,F,ᶠ,Ⓕ,Ŧ,F,ʄ,Ꭶ,ʄ,f,𝐅,𝗙,𝘍,𝙁,𝙵,F,ƒ,£,₣,千,ｷ
; 𝔊,𝕲,𝓖,𝒢,𝔾,Ｇ,ᧁ,ᧁׁ,ɢ,⊥,🄶,T,🅶,G,ᴳ,Ⓖ,ﻮ,G,ɢ,Ꮆ,ɠ,ງ,𝐆,𝗚,𝘎,𝙂,𝙶,G,g,G,₲,Ꮆ,ム
; ℌ,𝕳,𝓗,𝐻,ℍ,Ｈ,ꫝ,hׁׅ֮,ʜ,S,🄷,Ꙅ,🅷,ₕ,ᴴ,Ⓗ,ђ,H,ɦ,Ꮒ,ɧ,h,𝐇,𝗛,𝘏,𝙃,𝙷,Ή,н,H,Ⱨ,卄,ん
; ℑ,𝕴,𝓘,𝐼,𝕀,Ｉ,꠸,ꪱׁׅ,ɪ,ᴚ,🄸,Я,🅸,ᵢ,ᴵ,Ⓘ,เ,I,ɨ,Ꭵ,ı,i,𝐈,𝗜,𝘐,𝙄,𝙸,I,ι,Ì,ł,丨,ﾉ
; 𝔍,𝕵,𝓙,𝒥,𝕁,Ｊ,꠹,յׁׅ,ᴊ,Ό,🄹,Ọ,🅹,ⱼ,ᴶ,Ⓙ,ן,J,ʝ,Ꮰ,ʝ,ว,𝐉,𝗝,𝘑,𝙅,𝙹,J,נ,J,J,ﾌ,ﾌ
; 𝔎,𝕶,𝓚,𝒦,𝕂,Ｋ,ᛕ,ƙׁׅ֑,ᴋ,Ԁ,🄺,ꟼ,🅺,ₖ,ᴷ,Ⓚ,к,K,ӄ,Ꮶ,ƙ,k,𝐊,𝗞,𝘒,𝙆,𝙺,K,к,K,₭,Ҝ,ズ
; 𝔏,𝕷,𝓛,𝐿,𝕃,Ｌ,ꪶ,ᥣׁׅ֪,ʟ,O,🄻,O,🅻,ₗ,ᴸ,Ⓛ,ɭ,L,ʟ,Ꮭ,Ɩ,l,𝐋,𝗟,𝘓,𝙇,𝙻,ᄂ,ℓ,L,Ⱡ,ㄥ,ﾚ
; 𝔐,𝕸,𝓜,𝑀,𝕄,Ｍ,ꪑ, ,ᴍ,N,🄼,Ͷ,🅼,ₘ,ᴹ,Ⓜ,๓,M,ʍ,Ꮇ,ɱ,๓,𝐌,𝗠,𝘔,𝙈,𝙼,M,м,M,₥,爪,ﾶ
; 𝔑,𝕹,𝓝,𝒩,ℕ,Ｎ,ꪀ,ꩇׁׅ݊,ɴ,W,🄽,M,🅽,ₙ,ᴺ,Ⓝ,ภ,N,ռ,Ꮑ,ŋ,ຖ,𝐍,𝗡,𝘕,𝙉,𝙽,П,η,ñ,₦,几,刀
; 𝔒,𝕺,𝓞,𝒪,𝕆,Ｏ,ꪮ,ꪀׁׅ,ᴏ,˥,🄾,⅃,🅾,ₒ,ᴼ,Ⓞ,๏,O,օ,Ꭷ,ơ,໐,𝐎,𝗢,𝘖,𝙊,𝙾,Ө,σ,Ö,Ø,ㄖ,の
; 𝔓,𝕻,𝓟,𝒫,ℙ,Ｐ,ρ,ᨵׁׅ,ᴘ,⋊,🄿,⋊,🅿,ₚ,ᴾ,Ⓟ,ק,P,ք,Ꭾ,℘,p,𝐏,𝗣,𝘗,𝙋,𝙿,P,ρ,þ,₱,卩,ｱ
; 𝔔,𝕼,𝓠,𝒬,ℚ,Ｑ,ꪇ,℘,Q,ſ,🅀,Ⴑ,🆀,Q,Q,Ⓠ,ợ,Q,զ,Ꭴ,զ,๑,𝐐,𝗤,𝘘,𝙌,𝚀,Q,q,Q,Q,Ɋ,ゐ
; ℜ,𝕽,𝓡,𝑅,ℝ,Ｒ,᥅,qׁׅ,ʀ,I,🅁,I,🆁,ᵣ,ᴿ,Ⓡ,г,R,ʀ,Ꮢ,ཞ,r,𝐑,𝗥,𝘙,𝙍,𝚁,Я,я,R,Ɽ,尺,尺
; 𝔖,𝕾,𝓢,𝒮,𝕊,Ｓ,ᦓ,ꭈׁׅ,ꜱ,H,🅂,H,🆂,ₛ,ˢ,Ⓢ,ร,S,ֆ,Ꮥ,ʂ,Ş,𝐒,𝗦,𝘚,𝙎,𝚂,Ƨ,ѕ,§,₴,丂,丂
; 𝔗,𝕿,𝓣,𝒯,𝕋,Ｔ,ꪻ,꯱ׁׅ֒,ᴛ,⅁,🅃,Ꭾ,🆃,ₜ,ᵀ,Ⓣ,Շ,T,ȶ,Ꮦ,ɬ,t,𝐓,𝗧,𝘛,𝙏,𝚃,Ƭ,т,†,₮,ㄒ,ｲ
; 𝔘,𝖀,𝓤,𝒰,𝕌,Ｕ,ꪊ,tׁׅ,ᴜ,Ⅎ,🅄,ꟻ,🆄,ᵤ,ᵁ,Ⓤ,ย,U,ʊ,Ꮼ,ų,น,𝐔,𝗨,𝘜,𝙐,𝚄,Ц,υ,Ú,Ʉ,ㄩ,ひ
; 𝔙,𝖁,𝓥,𝒱,𝕍,Ｖ,ꪜ,υׁׅ,ᴠ,Ǝ,🅅,Ǝ,🆅,ᵥ,ⱽ,Ⓥ,ש,V,ʋ,Ꮙ,۷,ง,𝐕,𝗩,𝘝,𝙑,𝚅,V,ν,V,V,ᐯ,√
; 𝔚,𝖂,𝓦,𝒲,𝕎,Ｗ,᭙,᥎꫶ׁׅ,ᴡ,ᗡ,🅆,ᗡ,🆆,W,ᵂ,Ⓦ,ฬ,W,ա,Ꮗ,ῳ,ຟ,𝐖,𝗪,𝘞,𝙒,𝚆,Щ,ω,W,₩,山,W
; 𝔛,𝖃,𝓧,𝒳,𝕏,Ｘ,᥊,ᨰׁׅ,x,Ɔ,🅇,Ɔ,🆇,ₓ,ˣ,Ⓧ,א,X,Ӽ,ጀ,ҳ,x,𝐗,𝗫,𝘟,𝙓,𝚇,X,χ,×,Ӿ,乂,ﾒ
; 𝔜,𝖄,𝓨,𝒴,𝕐,Ｙ,ꪗ,᥊ׁׅ,ʏ,ᙠ,🅈,ᙠ,🆈,Y,ʸ,Ⓨ,ץ,Y,ʏ,Ꭹ,ყ,ฯ,𝐘,𝗬,𝘠,𝙔,𝚈,Y,у,¥,Ɏ,ㄚ,ﾘ
; ℨ,𝖅,𝓩,𝒵,ℤ,Ｚ,ƺ,ᨮ꫶ׁׅ֮zׁׅ֬,ᴢ,∀,🅉,A,🆉,Z,ᶻ,Ⓩ,չ,Z,ʐ,ፚ,ʑ,ຊ,𝐙,𝗭,𝘡,𝙕,𝚉,Z,z,Z,Ⱬ,乙,乙

; 𝖆,Ã,𝓪,𝒶,𝕒,ａ,𝒶,ᴀ,z,🄰,ƹ,🅰,ₐ,ᵃ,ⓐ,ค,α,ǟ,Ꮧ,ą,ค,𝐚,𝗮,𝘢,𝙖,𝚊,Λ,α,å,₳,卂,ﾑ
; 𝖇,乃,𝓫,𝒷,𝕓,ｂ,𝒷,ʙ,ʎ,🄱,ʏ,🅱,b,ᵇ,ⓑ,๒,Ⴆ,ɮ,Ᏸ,ც,๖,𝐛,𝗯,𝘣,𝙗,𝚋,B,в,ß,฿,乃,乃
; 𝖈,Č,𝓬,𝒸,𝕔,ｃ,𝒸,ᴄ,x,🄲,x,🅲,c,ᶜ,ⓒ,ς,ƈ,ƈ,ፈ,ƈ,¢,𝐜,𝗰,𝘤,𝙘,𝚌,ᄃ,¢,¢,₵,匚,ᄃ
; 𝖉,𝓓,𝓭,𝒹,𝕕,ｄ,𝒹,ᴅ,ʍ,🄳,w,🅳,d,ᵈ,ⓓ,๔,ԃ,ɖ,Ꮄ,ɖ,໓,𝐝,𝗱,𝘥,𝙙,𝚍,D,∂,Ð,Đ,ᗪ,り
; 𝖊,乇,𝓮,𝑒,𝕖,ｅ,𝑒,ᴇ,ʌ,🄴,v,🅴,ₑ,ᵉ,ⓔ,є,ҽ,ɛ,Ꮛ,ɛ,ē,𝐞,𝗲,𝘦,𝙚,𝚎,Σ,є,ê,Ɇ,乇,乇
; 𝖋,𝒇,𝓯,𝒻,𝕗,ｆ,𝒻,ꜰ,n,🄵,u,🅵,f,ᶠ,ⓕ,Ŧ,ϝ,ʄ,Ꭶ,ʄ,f,𝐟,𝗳,𝘧,𝙛,𝚏,F,ƒ,£,₣,千,ｷ
; 𝖌,Ğ,𝓰,𝑔,𝕘,ｇ,𝑔,ɢ,ʇ,🄶,ƚ,🅶,g,ᵍ,ⓖ,ﻮ,ɠ,ɢ,Ꮆ,ɠ,ງ,𝐠,𝗴,𝘨,𝙜,𝚐,G,g,g,₲,Ꮆ,ム
; 𝖍,ｈ,𝓱,𝒽,𝕙,ｈ,𝒽,ʜ,s,🄷,ꙅ,🅷,ₕ,ʰ,ⓗ,ђ,ԋ,ɦ,Ꮒ,ɧ,h,𝐡,𝗵,𝘩,𝙝,𝚑,Ή,н,h,Ⱨ,卄,ん
; 𝖎,Ɨ,𝓲,𝒾,𝕚,ｉ,𝒾,ɪ,ɹ,🄸,ɿ,🅸,ᵢ,ⁱ,ⓘ,เ,ι,ɨ,Ꭵ,ı,i,𝐢,𝗶,𝘪,𝙞,𝚒,I,ι,ï,ł,丨,ﾉ
; 𝖏,Ĵ,𝓳,𝒿,𝕛,ｊ,𝒿,ᴊ,b,🄹,p,🅹,ⱼ,ʲ,ⓙ,ן,ʝ,ʝ,Ꮰ,ʝ,ว,𝐣,𝗷,𝘫,𝙟,𝚓,J,נ,j,J,ﾌ,ﾌ
; 𝖐,ᵏ,𝓴,𝓀,𝕜,ｋ,𝓀,ᴋ,d,🄺,q,🅺,ₖ,ᵏ,ⓚ,к,ƙ,ӄ,Ꮶ,ƙ,k,𝐤,𝗸,𝘬,𝙠,𝚔,K,к,k,₭,Ҝ,ズ
; 𝖑,ᒪ,𝓵,𝓁,𝕝,ｌ,𝓁,ʟ,o,🄻,o,🅻,ₗ,ˡ,ⓛ,ɭ,ʅ,ʟ,Ꮭ,Ɩ,l,𝐥,𝗹,𝘭,𝙡,𝚕,ᄂ,ℓ,l,Ⱡ,ㄥ,ﾚ
; 𝖒,ⓜ,𝓶,𝓂,𝕞,ｍ,𝓂,ᴍ,u,🄼,ᴎ,🅼,ₘ,ᵐ,ⓜ,๓,ɱ,ʍ,Ꮇ,ɱ,๓,𝐦,𝗺,𝘮,𝙢,𝚖,M,м,m,₥,爪,ﾶ
; 𝖓,𝓃,𝓷,𝓃,𝕟,ｎ,𝓃,ɴ,ɯ,🄽,m,🅽,ₙ,ⁿ,ⓝ,ภ,ɳ,ռ,Ꮑ,ŋ,ຖ,𝐧,𝗻,𝘯,𝙣,𝚗,П,η,ñ,₦,几,刀
; 𝖔,ᗝ,𝓸,𝑜,𝕠,ｏ,❀,ᴏ,l,🄾,|,🅾,ₒ,ᵒ,ⓞ,๏,σ,օ,Ꭷ,ơ,໐,𝐨,𝗼,𝘰,𝙤,𝚘,Ө,σ,ð,Ø,ㄖ,の
; 𝖕,ℙ,𝓹,𝓅,𝕡,ｐ,𝓅,ᴘ,ʞ,🄿,ʞ,🅿,ₚ,ᵖ,ⓟ,ק,ρ,ք,Ꭾ,℘,p,𝐩,𝗽,𝘱,𝙥,𝚙,P,ρ,þ,₱,卩,ｱ
; 𝖖,Ǫ,𝓺,𝓆,𝕢,ｑ,𝓆,Q,ɾ,🅀,ꞁ,🆀,q,q,ⓠ,ợ,ϙ,զ,Ꭴ,զ,๑,𝐪,𝗾,𝘲,𝙦,𝚚,Q,q,q,Q,Ɋ,ゐ
; 𝖗,ŕ,𝓻,𝓇,𝕣,ｒ,𝓇,ʀ,ı,🅁,i,🆁,ᵣ,ʳ,ⓡ,г,ɾ,ʀ,Ꮢ,ཞ,r,𝐫,𝗿,𝘳,𝙧,𝚛,Я,я,r,Ɽ,尺,尺
; 𝖘,s,𝓼,𝓈,𝕤,ｓ,𝓈,ꜱ,ɥ,🅂,ʜ,🆂,ₛ,ˢ,ⓢ,ร,ʂ,ֆ,Ꮥ,ʂ,Ş,𝐬,𝘀,𝘴,𝙨,𝚜,Ƨ,ѕ,§,₴,丂,丂
; 𝖙,Ｔ,𝓽,𝓉,𝕥,ｔ,𝓉,ᴛ,ɓ,🅃,ǫ,🆃,ₜ,ᵗ,ⓣ,Շ,ƚ,ȶ,Ꮦ,ɬ,t,𝐭,𝘁,𝘵,𝙩,𝚝,Ƭ,т,†,₮,ㄒ,ｲ
; 𝖚,ᵘ,𝓾,𝓊,𝕦,ｕ,𝓊,ᴜ,ɟ,🅄,Ꮈ,🆄,ᵤ,ᵘ,ⓤ,ย,υ,ʊ,Ꮼ,ų,น,𝐮,𝘂,𝘶,𝙪,𝚞,Ц,υ,µ,Ʉ,ㄩ,ひ
; 𝖛,𝐯,𝓿,𝓋,𝕧,ｖ,𝓋,ᴠ,ǝ,🅅,ɘ,🆅,ᵥ,ᵛ,ⓥ,ש,ʋ,ʋ,Ꮙ,۷,ง,𝐯,𝘃,𝘷,𝙫,𝚟,V,ν,v,V,ᐯ,√
; 𝖜,𝔴,𝔀,𝓌,𝕨,ｗ,𝓌,ᴡ,p,🅆,b,🆆,w,ʷ,ⓦ,ฬ,ɯ,ա,Ꮗ,ῳ,ຟ,𝐰,𝘄,𝘸,𝙬,𝚠,Щ,ω,w,₩,山,W
; 𝖝,Ж,𝔁,𝓍,𝕩,ｘ,𝓍,x,ɔ,🅇,ɔ,🆇,ₓ,ˣ,ⓧ,א,x,Ӽ,ጀ,ҳ,x,𝐱,𝘅,𝘹,𝙭,𝚡,X,χ,x,Ӿ,乂,ﾒ
; 𝖞,𝓨,𝔂,𝓎,𝕪,ｙ,𝓎,ʏ,q,🅈,d,🆈,y,ʸ,ⓨ,ץ,ყ,ʏ,Ꭹ,ყ,ฯ,𝐲,𝘆,𝘺,𝙮,𝚢,Y,у,¥,Ɏ,ㄚ,ﾘ
; 𝖟,z,𝔃,𝓏,𝕫,ｚ,𝓏,ᴢ,ɐ,🅉,ɒ,🆉,z,ᶻ,ⓩ,չ,ȥ,ʐ,ፚ,ʑ,ຊ,𝐳,𝘇,𝘻,𝙯,𝚣,Z,z,z,Ⱬ,乙,乙
; numbers aren't that unique

; Characters are gathered from various sources
; https://util.unicode.org/UnicodeJsps/confusables.jsp (some characters removed due to browsers not being able to display them, not so alikes)
; 𝙰,A,𝐴,ᗅ,𝑨,𝚨,𝕬,𝖠,А,Α,𝛢,𝝖,𝒜,𝜜,𖽀,𝓐,𝞐,Ａ,𝗔,𝘈,Ꭺ,ꓮ,𝐀,𝔄,𝔸,𐊠,𝘼
; B,𝕭,𝙱,𝑩,𝚩,ꓐ,Β,В,𝜝,𝛣,𝖡,𝝗,𐊂,𐌁,𝗕,Ｂ,𝓑,𝞑,𝔅,ℬ,𝘉,𝘽,Ꞵ,Ᏼ,𝐁,ᗷ,𐊡,𝐵,𝔹
; ℂ,𝕮,C,𝙲,𝑪,𝒞,𝖢,𐌂,𝗖,ꓚ,Ꮯ,𐔜,С,Ｃ,Ⲥ,𝓒,Ⅽ,ℭ,𝘊,𐐕,𝘾,🝌,𝐂,𑣲,𑣩,Ϲ,𐊢,𝐶
; Ꭰ,𝕯,D,ⅅ,𝓓,𝙳,𝔇,ᗪ,𝑫,𝘋,Ⅾ,𝒟,𝘿,ꓓ,𝐃,𝖣,𝐷,𝗗,𝔻,ᗞ
; 𝕰,𝙴,E,𝛦,𝑬,𝚬,𝜠,𝖤,Ε,Е,𝗘,𐊆,𝝚,𝓔,𝞔,Ｅ,𝔈,𝘌,Ꭼ,ℰ,𝙀,ꓰ,𑢮,𝐄,𝐸,ⴹ,𑢦,𝔼,⋿
; 𝑭,𝈓,F,𝕱,𑢢,𝖥,Ꞙ,𝓕,Ϝ,𐊇,ꓝ,𝗙,𐔥,𝘍,𑣂,𝐅,𝟊,𝔉,ℱ,𝔽,ᖴ,𝙁,𝙵,𐊥,𝐹
; Ꮐ,𝑮,𝘎,𝕲,G,𝐆,𝖦,Ԍ,𝔊,𝔾,Ᏻ,𝒢,𝙂,ꓖ,𝓖,𝙶,𝐺,𝗚
; 𝑯,𝚮,𝕳,H,𝛨,𝖧,ℋ,ℌ,ℍ,Ⲏ,𐋏,𝜢,Η,𝓗,𝞖,𝝜,𝗛,Н,𝘏,ꓧ,Ｈ,𝐇,𝙃,𝙷,Ꮋ,ᕼ,𝐻
; 𝚰,𝘭,І,𝖨,𝐥,ﺍ,ﺎ,𝔩,ℐ,ℑ,𐊊,Ⲓ,𐌉,ℓ,𝜤,Ɩ,𝞘,Ι,𝚕,𝟏,∣,ا,Ｉ,𝗅,𝕀,1,𝙄,𝓁,𐌠,𝐼,𝑰,ǀ,Ӏ,ᛁ,𝟭,𝕴,I,ߊ,ｌ,𝛪,ⵏ,𝝞,𝕝,𝟣,ו,𞣇,𝙡,𝓘,𝗜,𝟙,𝑙,ן,Ⅰ,𝘐,١,𝒍,𝖑,￨,𝐈,l,۱,ꓲ,𖼨,𝙸,𝟷,𝓵,|,ⅼ,⏽,𝗹
; 𝔍,𝑱,𝘑,Ј,J,Ｊ,𝒥,𝙅,Ꭻ,ᒍ,𝐉,𝖩,Ʝ,𝐽,𝗝,𝕁,ꓙ,𝕵,𝓙,𝙹,Ϳ
; 𝑲,𝚱,𝒦,K,𝜥,𝛫,𝖪,𝝟,𝗞,Ⲕ,ᛕ,ꓗ,Κ,К,𝓚,𝞙,𝔎,𝘒,Ꮶ,𝙆,Ｋ,𐔘,𝐊,𝐾,𝕂,𝕶,𝙺
; 𖼖,𝑳,𑢣,L,𝖫,Ⳑ,𝗟,ℒ,𝓛,Ꮮ,𐔦,𝔏,ꓡ,𐐛,𝘓,𝙇,ᒪ,Ⅼ,𝈪,𝐋,𝐿,𝕃,𑢲,𝕷,𝙻
; 𝛭,𝑴,𝚳,𝜧,𐌑,𝖬,M,𝗠,ᛖ,𝝡,Ⲙ,𝓜,Μ,М,𝞛,ꓟ,𝔐,𝘔,𝙈,𐊰,𝐌,Ｍ,Ⅿ,𝑀,ᗰ,ℳ,𝕄,Ꮇ,𝕸,Ϻ,𝙼
; ꓠ,𝛮,𝐍,𝖭,𝚴,𝔑,𝜨,𐔓,N,Ｎ,𝒩,𝙉,𝓝,𝙽,ℕ,𝝢,𝑁,𝗡,Ⲛ,𝑵,𝘕,𝞜,Ν,𝕹
; ߀,𝛰,𑣠,𝖮,〇,𐊒,𝟬,𝒪,𝜪,O,ዐ,𝓞,𝞞,𝝤,ⵔ,Օ,𝟢,𝗢,𝟘,𝘖,Ⲟ,О,Ο,ଠ,𝟎,𝐎,০,୦,𝔒,🯰,𝕆,𝙊,𐔖,Ｏ,0,𑓐,𐊫,𝙾,ꓳ,𑢵,𝑂,𐐄,𝟶,𝑶,𝚶,𐓂,𝕺
; 𝖯,𝛲,𝝦,𝜬,𝒫,𐊕,P,𝞠,𝓟,ꓑ,𝗣,ℙ,𝘗,Р,𝐏,Ρ,Ⲣ,Ꮲ,𝔓,𝙋,ᑭ,Ｐ,𝙿,𝑃,𝚸,𝑷
; 𝐐,𝖰,𝔔,𝒬,𝙌,𝓠,𝚀,Q,𝑄,𝗤,ⵕ,𝑸,𝘘,ℚ,𝕼
; Ꭱ,𖼵,𝙍,ꓣ,Ʀ,𝐑,𝖱,ᖇ,𐒴,𝑅,𝗥,R,Ꮢ,𝕽,𝓡,𝚁,𝈖,ℛ,ℜ,ℝ,𝑹,𝘙
; 𝒮,𝙎,ꓢ,𖼺,𐐠,Ѕ,𝐒,𝖲,𝑆,𝗦,𐊖,𝕊,Տ,𝕾,S,Ｓ,Ꮥ,𝓢,𝚂,𝔖,Ꮪ,𝑺,𝘚
; 𝒯,𝜯,𝖳,𝗧,𐊗,𐌕,𝝩,🝨,T,ꓔ,𖼊,𝓣,𝞣,⟙,𝔗,𝘛,𝙏,Т,Ꭲ,⊤,Τ,𝐓,Ⲧ,𝑇,𐊱,𝕋,𑢼,𝕿,Ｔ,𝚃,𝛵,𝑻,𝚻
; 𝒰,𝙐,ሀ,⋃,𝐔,𝖴,𝑈,𝗨,𑢸,∪,𝕌,ᑌ,Ս,𝖀,𝓤,𝚄,ꓴ,U,𐓎,𝔘,𝑼,𝘜,𖽂
; 𑢠,𝈍,𝒱,𝓥,𝗩,𝘝,V,𖼈,Ꮩ,𝐕,𝔙,ꛟ,𝕍,Ⅴ,ꓦ,٧,𝙑,𐔝,𝚅,𝑉,ᐯ,𝑽,Ѵ,۷,𝖁,ⴸ,𝖵
; 𝕎,𝒲,𝙒,𝓦,𝚆,ꓪ,𝑊,𝗪,𑣯,𝑾,𝘞,Ꮃ,Ꮤ,𝖂,W,𝐖,𝖶,𑣦,Ԝ,𝔚
; 𝒳,𝜲,𝓧,𝞦,𐊐,𝝬,𐌗,𝗫,𝘟,X,𝐗,𝔛,ⵝ,𐔧,𝕏,𝙓,Х,Χ,Ⅹ,𝚇,ꓫ,Ⲭ,᙭,𝑋,𐊴,𝑿,𝚾,╳,Ꭓ,𝖃,ᚷ,Ｘ,𝛸,𐌢,𝖷,𑣬
; 𝜰,𝒴,𑢤,𝓨,𝗬,𝝪,𝘠,ϒ,𖽃,𝞤,𝐘,Y,𝔜,𝕐,У,𝙔,Υ,𝚈,Ⲩ,Ꭹ,𐊲,𝑌,ꓬ,Ү,𝒀,𝖄,𝖸,Ｙ,𝛶,𝚼,Ꮍ
; 𝗭,𝚭,Ꮓ,𑣥,𝛧,𝓩,Ζ,𝘡,𝜡,Z,𝙕,𝞕,ꓜ,𝝛,𝐙,𝑍,ℤ,ℨ,𝖅,𑢩,Ｚ,𝒵,𝖹

; 𝝰,a,ａ,𝑎,𝗮,𝕒,𝖆,𝓪,𝚊,𝞪,а,ɑ,α,𝔞,𝒂,𝘢,𝛂,⍺,𝒶,𝙖,𝜶,𝛼,𝐚,𝖺
; 𝑏,𝗯,b,Ƅ,𝕓,𝖇,Ь,𝓫,𝚋,Ꮟ,ᖯ,𝔟,ᑲ,𝒃,𝘣,𝒷,𝙗,𝐛,𝖻
; 𝑐,𝗰,с,c,ｃ,𝕔,ᴄ,ⲥ,𐐽,𝖈,𝓬,𝚌,ꮯ,𝔠,ϲ,𝒄,𝘤,𝒸,𝙘,𝐜,𝖼,ⅽ
; ԁ,𝓭,𝚍,d,ⅆ,𝑑,𝗱,Ꮷ,𝒅,𝘥,𝖉,ᑯ,ꓒ,𝐝,𝖽,𝔡,𝕕,ⅾ,𝒹,𝙙
; 𝓮,𝚎,e,ｅ,𝑒,𝗲,ⅇ,𝒆,𝘦,℮,𝖊,ℯ,𝐞,𝖾,ꬲ,е,𝔢,𝕖,ҽ,𝙚
; 𝓯,𝚏,ք,𝑓,𝗳,f,𝒇,𝘧,𝖋,𝐟,𝖿,𝔣,ꬵ,𝕗,ꞙ,𝒻,𝙛,ẝ,ſ
; 𝓰,𝚐,ɡ,ց,ᶃ,𝑔,𝗴,g,ｇ,𝒈,𝘨,ℊ,𝖌,ƍ,𝐠,𝗀,𝔤,𝕘,𝙜
; Ꮒ,𝖍,𝓱,𝚑,h,ｈ,𝔥,ℎ,𝒉,𝘩,հ,𝒽,𝙝,𝐡,𝗁,𝗵,һ,𝕙
; 𝓲,𝞲,ꙇ,ⅈ,ｉ,𝔦,𝘪,ӏ,𝙞,𝚤,𝐢,і,𝑖,˛,𝕚,𝖎,Ꭵ,𝚒,𑣃,i,ɩ,ɪ,𝒊,𝛊,ⅰ,ı,𝒾,𝜾,⍳,𝜄,ꭵ,𝗂,𝝸,ℹ,ι,𝗶,ͺ
; 𝖏,𝓳,𝚓,ⅉ,𝔧,j,ｊ,𝒋,𝘫,𝒿,𝙟,ϳ,𝐣,𝗃,ј,𝑗,𝗷,𝕛
; 𝖐,𝓴,𝚔,𝔨,k,𝒌,𝘬,𝓀,𝙠,𝐤,𝗄,𝑘,𝗸,𝕜
; 𝚰,𝘭,І,𝖨,𝐥,ﺍ,ﺎ,𝔩,ℐ,ℑ,𐊊,Ⲓ,𐌉,ℓ,𝜤,Ɩ,𝞘,Ι,𝚕,𝟏,∣,ا,Ｉ,𝗅,𝕀,1,𝙄,𝓁,𐌠,𝐼,𝑰,ǀ,Ӏ,ᛁ,𝟭,𝕴,I,ߊ,ｌ,𝛪,ⵏ,𝝞,𝕝,𝟣,ו,𞣇,𝙡,𝓘,𝗜,𝟙,𝑙,ן,Ⅰ,𝘐,١,𝒍,𝖑,￨,𝐈,l,۱,ꓲ,𖼨,𝙸,𝟷,𝓵,|,ⅼ,⏽,𝗹
; 𑜀,𝒎,𝘮,𑣣,𝖒,𝐦,𝗆,m,𝔪,𝕞,𝓂,𝙢,𝓶,𝚖,𝑚,𝗺,ⅿ
; 𝒏,𝘯,𝖓,𝐧,𝗇,𝔫,n,𝕟,𝓃,𝙣,ո,𝓷,𝚗,ռ,𝑛,𝗻
; 𝘰,ం,ಂ,ം,ං,օ,𝐨,𑣗,𝔬,ᴏ,ᴑ,𐓪,𝚘,𑣈,ဝ,ⲟ,𝛐,ഠ,𝛔,𝗈,𝝈,ℴ,𝝄,𝞸,𝞼,ꬽ,о,ο,၀,ہ,σ,ه,ｏ,๐,໐,𝕠,𐐬,𝙤,ە,𝑜,𝒐,ס,𝜎,𝖔,٥,०,੦,૦,௦,౦,೦,൦,𝜊,o,𝝾,۵,𝞂,𝓸,𝗼,ჿ
; р,ρ,𝔭,𝘱,𝙥,𝐩,ｐ,𝛠,𝑝,𝕡,𝖕,𝜚,𝚙,𝞎,ⲣ,𝝔,𝛒,𝒑,𝟈,𝝆,𝓅,𝜌,𝗉,p,𝞀,ϱ,𝗽,⍴,𝞺,𝓹
; 𝔮,գ,𝒒,𝘲,զ,𝓆,𝙦,𝐪,𝗊,q,𝑞,𝗾,𝕢,𝖖,ԛ,𝓺,𝚚
; 𝔯,ꮁ,𝒓,𝘳,ⲅ,ᴦ,ꭇ,ꭈ,𝓇,𝙧,𝐫,𝗋,𝑟,𝗿,r,г,𝕣,𝖗,𝓻,𝚛
; 𝔰,𑣁,𝒔,𝘴,𝓈,𝙨,ꮪ,𝐬,𝗌,𝑠,𝘀,ꜱ,s,ｓ,𝕤,ѕ,𝖘,𝓼,𝚜,𐑈,ƽ
; 𝐭,𝗍,𝔱,𝕥,𝓉,𝙩,𝓽,𝚝,t,𝑡,𝘁,𝒕,𝘵,𝖙
; 𝐮,υ,𝔲,𑣘,𝕦,ʋ,𝙪,ꭎ,𐓶,𝚞,ꭒ,𝑢,𝒖,𝛖,ᴜ,𝖚,ꞟ,𝜐,𝗎,𝓊,𝝊,𝓾,𝞾,𝞄,u,𝘂,𝘶,ս
; ⋁,𝐯,𝔳,𝕧,𝙫,𝚟,𝑣,ｖ,ט,𝒗,𝖛,ᴠ,𝗏,𑣀,𝛎,∨,𝜈,ꮩ,𝓋,𝓿,ⅴ,𝘃,ѵ,v,𝝂,𝘷,𝞶,𑜆,𝝼,ν
; 𝐰,𝗐,ᴡ,ѡ,ա,ꮃ,𝔴,𝕨,𝓌,𝙬,ɯ,𝔀,𝚠,𑜏,𑜎,𝑤,𝘄,w,𝒘,𝘸,𝖜,ԝ,𑜊
; ᕁ,𝓍,𝙭,х,𝐱,𝗑,⤫,𝑥,𝘅,⤬,᙮,⨯,𝕩,𝖝,×,𝔁,𝚡,x,ｘ,ⅹ,𝔵,ᕽ,𝒙,𝘹
; 𝙮,у,𝐲,𝝲,𝑦,ᶌ,𝞬,𑣜,𝕪,ʏ,𝖞,𝚢,ｙ,ꭚ,𝒚,𝓎,ɣ,𝗒,ყ,𝘆,ү,𝛾,γ,𝛄,𝔂,𝜸,y,𝔶,ℽ,𝘺,ỿ
; 𝓏,𝙯,ᴢ,𝐳,𝗓,𑣄,𝑧,𝘇,𝕫,𝖟,ꮓ,𝔃,𝚣,𝔷,z,𝒛,𝘻
; ߀,𝛰,𑣠,𝖮,〇,𐊒,𝟬,𝒪,𝜪,O,ዐ,𝓞,𝞞,𝝤,ⵔ,Օ,𝟢,𝗢,𝟘,𝘖,Ⲟ,О,Ο,ଠ,𝟎,𝐎,০,୦,𝔒,🯰,𝕆,𝙊,𐔖,Ｏ,0,𑓐,𐊫,𝙾,ꓳ,𑢵,𝑂,𐐄,𝟶,𝑶,𝚶,𐓂,𝕺
; 𝚰,𝘭,І,𝖨,𝐥,ﺍ,ﺎ,𝔩,ℐ,ℑ,𐊊,Ⲓ,𐌉,ℓ,𝜤,Ɩ,𝞘,Ι,𝚕,𝟏,∣,ا,Ｉ,𝗅,𝕀,1,𝙄,𝓁,𐌠,𝐼,׀,𝑰,ǀ,Ӏ,ᛁ,𝟭,𝕴,I,ߊ,ｌ,𝛪,ⵏ,𝝞,𝕝,𝟣,ו,𞣇,𝙡,𝓘,𝗜,𝟙,𝑙,ן,Ⅰ,𝘐,١,𝒍,𝖑,￨,𝐈,l,۱,ꓲ,𖼨,𝙸,𝟷,𝓵,|,ⅼ,⏽,𝗹
; 𝟐,𝟮,Ꙅ,Ƨ,Ϩ,ꛯ,2,𝟤,𝟸,Ꝛ,𝟚,ᒿ
; Ӡ,𝟯,𝟑,𝈆,Ꝫ,𝟥,Ɜ,Ⳍ,3,Ʒ,З,𖼻,Ȝ,𝟛,𝟹,𑣊
; 𝟰,𑢯,4,𝟒,𝟦,𝟜,𝟺,Ꮞ
; 𝟝,5,𝟓,𝟱,𝟧,Ƽ,𝟻,𑢻
; б,𝟞,Ⳓ,𝟔,𑣕,6,𝟲,𝟨,𝟼,Ꮾ
; 𝟟,𝟽,𝈒,𝟳,7,𐓒,𝟕,𑣆,𝟩
; 𐌚,Ȣ,ଃ,ȣ,𝟴,৪,੪,𞣋,𝟪,𝟠,𝟾,8,𝟖
; ੧,୨,Ⳋ,𑣖,৭,൭,𝟫,Ꝯ,𝟿,𝟡,9,𝟗,𝟵,𑣌,𑢬
; they also have ones for symbols like "&" but I think that would be overdoing it

; wikipedia(can't remember the page) & various
; TODO include a more extensive list of glyphs?
; ᾰ,ḁ,ἀ,ἁ,ἂ,ἃ,ἄ,ἅ,ἆ,ἇ,ạ,ả,ầ,ấ,ẩ,ẫ,ậ,ắ,ằ,ẳ,ẵ,ặ,ẚ,ᾱ,ᾲ,ᾳ,ᾴ,ᾶ,ᾷ,a,Ѧ,Ặ,Ἀ,Ἁ,Ἂ,Ἃ,Ἄ,Ἅ,Ἆ,Ἇ,Ạ,Ả,Ấ,Ầ,Ẩ,Ẫ,Ậ,Ắ,Ằ,Ẳ,Ẵ
; ദ,൫,♭,ḃ,ḅ,ḇ,b,ℬ,Ḃ,Ḅ,Ḇ,B,ß
; ç,ḉ,c,ℂ,ℭ,℃,₡,∁,C
; ⅾ,ḋ,ḍ,ḏ,ḑ,ḓ,d,Ḓ,Ḋ,Ḍ,Ḏ,Ḑ,D
; ℯ,∊,€,ḕ,ḗ,ḙ,ḛ,ḝ,ẹ,ẻ,ẽ,ế,ề,ể,ễ,ệ,ἐ,ἑ,ἒ,ἓ,ἔ,ἕ,ὲ,έ,e,ℰ,ℇ,∃,Ḕ,Ḗ,Ḙ,Ḛ,Ḝ,Ẹ,Ẻ,Ẽ,Ế,Ề,Ể,Ễ,Ệ,Ὲ,Έ,Ἐ,Ἑ,Ἒ,Ἓ,Ἔ,Ἕ
; ❡,ḡ,ℊ,g,ℊ,Ḡ,G
; ⓗ,⒣,ℎ,ℏ,ℌ,ḣ,ḥ,ḧ,ḩ,ḫ,ẖ,h,ℋ,ℍ,Ḣ,Ḥ,Ḧ,Ḩ,Ḫ,Ἠ,Ħ,Ἡ,Ἢ,Ἣ,Ἤ,Ἥ,Ἦ,Ἧ,ᾘ,ᾙ,ᾚ,ᾛ,ᾜ,ᾝ,ᾞ,ᾟ,Ὴ,Ή,ῌ,H
; ї,유,ḭ,ḯ,ỉ,ị,ἰ,ἱ,ἲ,ἳ,ἴ,ἵ,ἶ,ἷ,ῐ,ῑ,ῒ,ΐ,ῖ,ῗ,ὶ,ί,i,Ї,ℐ,Ḭ,ḭ,Ḯ,ḯ,Ỉ,ỉ,Ị,ị,ἰ,ἱ,ἲ,ἳ,ἴ,ἵ,ἶ,ἷ,Ἰ,Ἱ,Ἲ,Ἳ,Ἴ,Ἵ,Ἶ,Ἷ,ῐ,ῑ,ῒ,ΐ,ῖ,ῗ,Ῐ,Ῑ,Ὶ,Ί,ὶ,ί,I
; ʝ,♩,j,J
; к,ḱ,ḳ,ḵ,k,₭,Ḱ,Ḳ,Ḵ,K
; ℓ,ḻ,ḽ,l,ℒ,₤,Ḷ,Ḹ,Ḻ,Ḽ,L
; Պ,ṃ,ḿ,ṁ,m,Ḿ,Ṁ,Ṃ,M,സ,൬,ന,ണ,൩
; η,ℵ,ṅ,ṇ,ṉ,ṋ,ἠ,ἡ,ἢ,ἣ,ἤ,ἥ,ἦ,ἧ,ὴ,ή,ᾐ,ᾑ,ᾒ,ᾓ,ᾔ,ᾕ,ᾖ,ᾗ,ῂ,ῃ,ῄ,ῆ,ῇ,n,ℕ,₦,Ṅ,Ṇ,Ṉ,Ṋ,N
; ⍥,ṍ,ṏ,ṑ,ṓ,ọ,ỏ,ố,ồ,ổ,ỗ,ớ,ờ,ở,ỡ,ợ,ὀ,ὁ,ὂ,ὃ,ὄ,ὅ,ộ,o,Ṍ,Ṏ,Ṑ,Ṓ,Ọ,Ỏ,Ố,Ồ,Ổ,Ỗ,Ộ,Ớ,Ờ,Ở,Ỡ,Ợ,Ὀ,Ὁ,Ὂ,Ὃ,Ὄ,O
; ℘,ṗ,ṕ,ῥ,ῤ,p,ℙ,Ṗ,Ῥ,Ṕ,P
; ҩ,ǭ,q,ℚ,Ǭ,Q
; Ի,ṟ,ṙ,ṛ,ṝ,r,ℛ,ℜ,ℝ,℟,Ṙ,Ṛ,Ṝ,Ṟ,R
; ട,ഗ,ṡ,ṣ,ṥ,ṧ,ṩ,ş,﹩,s,Š,Ṡ,Ṣ,Ṥ,Ṧ,Ṩ,S,$
; ṫ,ṭ,ṯ,ṱ,ẗ,†,t,₮,Ṫ,Ṭ,Ṯ,Ṱ,T,₺
; υ,ṳ,ṵ,ṷ,ṹ,ṻ,ụ,ủ,ứ,ừ,ử,ữ,ự,ὐ,ὑ,ὒ,ὓ,ὔ,ὕ,ὖ,ὗ,ὺ,ύ,ῠ,ῡ,ῢ,ΰ,ῦ,ῧ,u,Ṳ,Ụ,Ủ,Ứ,Ừ,Ử,Ữ,Ự,Ṷ,Ṹ,Ṻ,Ṵ,U
; ṽ,ṿ,v,Ṽ,Ṿ,V
; ഡ,ധ,ω,ẁ,ẃ,ẅ,ẇ,ẉ,ẘ,ὠ,ὡ,ὢ,ὣ,ὤ,ὥ,ὦ,ὧ,ὼ,ώ,ᾠ,ᾡ,ᾢ,ᾣ,ᾤ,ᾥ,ᾦ,ᾧ,ῲ,ῳ,ῴ,ῶ,ῷ,w,₩,Ẁ,Ẃ,Ẅ,Ẇ,Ẉ,W
; ✗,✘,ẋ,ẍ,x,Ẍ,Ẋ,X
; ỵ,ỷ,ỹ,ẏ,y,ㄚ,Ẏ,Ὑ,Ὓ,Ὕ,Ὗ,Ῠ,Ῡ,Ὺ,Ύ,Ỳ,Ỵ,Ỷ,Ỹ,Y,ⓨ,൮,⑂,ഴ,ẙ,ỳ
; ℨ,ẑ,ẓ,ẕ,z,Ž,ℤ,Ẑ,Ẕ,Ẓ,Z
; ∅
; ⅼ
; Ⅱ
; Ⅲ
; Ⅳ
; Ⅴ
; Ⅵ
; Ⅶ
; Ⅷ
; Ⅸ
; they might be duplicated